perf/loadTesting/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/metar'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  payload:
    path: "../airport_codes.csv"
    fields:
      - "code"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm Up
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain load
      duration: 60
      arrivalRate: 200
    - name: Cool Down
      duration: 30
      arrivalRate: 100
      rampTo: 1

scenarios:
  - name: LoadMetar (/)
    flow:
      - get:
          url: '/?station={{ code }}'