perf/loadTesting/spaceflight.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/spaceflight_news'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections


  phases:
    - name: Warm Up
      duration: 60
      arrivalRate: 1
      rampTo: 10
    - name: Plain load
      duration: 60
      arrivalRate: 150
    - name: Cool Down
      duration: 30
      arrivalRate: 50
      rampTo: 1


scenarios:
  - name: LoadSpaceflight (/)
    flow:
      - get:
          url: '/'